CSI API ETABS v1
cAreaElm.GetThickness Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetThickness(
	string Name,
	ref int ThicknessType,
	ref string ThicknessPattern,
	ref double ThicknessPatternSF,
	ref double[] Thickness
)
Function GetThickness (
	Name As String,
	ByRef ThicknessType As Integer,
	ByRef ThicknessPattern As String,
	ByRef ThicknessPatternSF As Double,
	ByRef Thickness As Double()
) As Integer
Dim instance As cAreaElm
Dim Name As String
Dim ThicknessType As Integer
Dim ThicknessPattern As String
Dim ThicknessPatternSF As Double
Dim Thickness As Double()
Dim returnValue As Integer
returnValue = instance.GetThickness(Name,
	ThicknessType, ThicknessPattern,
	ThicknessPatternSF, Thickness)
int GetThickness(
	String^ Name,
	int% ThicknessType,
	String^% ThicknessPattern,
	double% ThicknessPatternSF,
	array<double>^% Thickness
)
abstract GetThickness :
        Name : string *
        ThicknessType : int byref *
        ThicknessPattern : string byref *
        ThicknessPatternSF : float byref *
        Thickness : float[] byref -> int
Parameters
Name
Type: System.String
ThicknessType
Type: System.Int32
ThicknessPattern
Type: System.String
ThicknessPatternSF
Type: System.Double
Thickness
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cAreaElm Interface
ETABSv1 Namespace